Revit 2024 API
BuiltInFailures.RoofFailures.UptoHeightTooLow Property
 Cutoff Level cannot be below bottom of roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UptoHeightTooLow { get; }
Visual Basic
Public Shared ReadOnly Property UptoHeightTooLow As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UptoHeightTooLow {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace